#Unit3.3 명령 프롬프트에서 HELLO world! 출력하기

#명령 프롬프트에서 HELLO world! 출력하기
#IDLE을 사용하지 않고 명령 프롬프트에서 파이썬 셀을 실행한 뒤 HELLO world! 를 출력해보기
# 명령 프롬프트에서 스크립트 파일을 실행하는 방법

# 명령 프롬프트에서 파이썬 사용하기
#Win + R 을 누른뒤 cmd를 입력하여 명령 프롬프트를 실행 
#python을 입력하여 파이썬 셀을 실행
#print('Hello world')를 입력한 뒤 엔터 키를 누름

#명령 프롬프트에서도 파이썬 셀을 실행하여 파이썬을 사용할수있음
#명령 프롬프트에서 파이썬 셀을 끝내려면 exit()를 입력하거나 Ctrl + Z 를 누름

#에러 | 명령 프롬프트에서 파이썬이 실행되지 않을 때
#파이썬을 삭제한 뒤 다시 설치
#제어판 > 프로그램 > 프로그램 제거 > Python 3.6.0(32-bit)를 클릭
#Uninstall 을 클릭
#'Unit 2 파이썬 설치하기'를 참고하여 파이썬을 다시설치 단 , 설치할때 반드시 ADD python 3.6 to PATH에 체크
#또는 제어판 > 시스템 및 보안 > 시스템 > 고급 시스템 설정 > 환경 변수(N)...에서<사용자이름> 에 대한 사용자 변수 에서 Path를 선택하고 편집 을 클릭
#새로 만들기 을 클릭한 뒤 다음 두 경로를 추가
#<사용자 이름>은 자신의 Windows 계정 이름 넣기

#명령 프롬프트에서 스크립트 파일 실행하기
#명령프롬프트에서 hello py 파일을 실행 
#Win + R 을 누른 뒤 cmd 를 입력하여 명령 프롬프트를 실행 
#WPROJECT 폴더로 이동
#PYTHON HELLO.PY를 입력하여 스크립트 파일을 실행