#3.1.IDLE에서  HELLO world !
print("HELLO WORLD")
#에러
#NameERROR:name__is not defind : 함수 이름을 잘못 입력했을떄 에러
#파이썬은 대소문자를 구분하므로 대소문자를 정확히 입력
#print처럼 전부 소문자로 입력했는지 확인
#SyntaxERROR : invild synatx : print()안에 문자를 넣을떄 작은따음표로 묶지않아서 발생하는 구몬에러
#작은따옴표로 묶어줌
#SyntaxERROR : EOL while scanning string literal : 따옴표를 잘못 사용하였을 때 발생하는 구몬에러
#'HELLo world!'와 같이 앞 뒤로 작은따음표 쌍이 맞는지 확인

#IDLE에서 HELLO WORLD! 출력하기
#코드를 한 줄 한 줄 실행하며 결과를 얻는 방식을 인터프리터방식
#IDLE처럼 파이썬 코드를 직접 입력해서 실행하는 프로그램을 파이썬 셀 이라고 함
#부분을 파이썬프롬프트라고 부름

#참고 | 대화형 셸
#파이썬 셸은 파이썬 인터프리터와 대화하듯이 코드를 처리한다고 해서 대화형 셸 또는 인터렉티브 모드라고도 부름. 
#이런 방식을 코드를 읽고, 평가(계산, 실행)하고, 출력한다고 해서 REPL 라고 함

#참고 IDLE의 파이썬 셀에서 에러가 났을 떄
# IDLE의 파이썬 셀에서 코드를 잘못 입력하여 에러가 나면 올바른 코드를 다시 입력
# IDLE의 파이썬 셀에서 코드를 잘못 입력하여 에러가나면 코드를 다시 입력
# IDLE의 파이썬 셀에서는 위쪽 방향키를 누르면 이전으로 돌아감
# 이전코드에서 엔터를 누르면 해당 코드를 다시 사용할 수 있음 