#unit3.5.심사사이트 사용하기
#심사 사이트 이용하기
#파이썬 코딩 도장은 책에서 배운 내용을 완전히 익힐수있도록 웹 사이트에서 퀴즈와 심사문제를 제공
#퀴즈 : 객관식 문제와 짧은 답안을 입력하는 주관식문제
#심사문제 : 문제의 답안을 파이썬으로 작성하여 제출하는 방식 : 미 완성된 코드에서 일부분만 제출하는 문제와 전체 코드를 제출하는 문제

#웹 브라우저를 실행하고 https://dojang.io 로 이동
#심사 사이트에서 퀴즈를 풀려면 회원 가입과 로그인이 필요
#다음 순서대로 회원 가입을 함
#화면 오른쪽 웨에 로그인 링크 클릭
#구글 또는 페이스북 계정이 있으면 Log in with Google, Log in with Facebook 버튼을 클릭
#정보 제공을 허가하면 바로 회원 가입과 로그인이 됨

#>>심사 사이트 사용하기
#만약 구글 또는 페이스북 계정을 사용하지 않으려면  다음 순서대로 회원 가입을 함
#화면 오른쪽 위의 로그인 링크 클릭
#새 계정 화면에서 회원 가입(이메일 인증을 하므로 실제로 사용하는 이메일 주소를 입력)
#이메일 주소의 메일함의 계정 승인 메일이 도착해있을겄
#가입한 계정으로 로그인
#로그인을 하면 심사 사이트의 메인 화면이 나옴 여기서 이용할수있는 강좌 > 파이썬 코딩 도장 > 시작하기 버튼을 클릭

